In [12]:
import pandas as pd

In [13]:
df=pd.read_csv("employees.csv")

In [14]:
df.size  # Gives rows X columns i.e number of elements

550

In [15]:
df.ndim # Gives Dimension

2

In [16]:
df.shape  # gives shape i.e rows and columns

(50, 11)

In [17]:
df.dtypes  # Gives datatypes

EMPLOYEE_ID        int64
FIRST_NAME        object
LAST_NAME         object
EMAIL             object
PHONE_NUMBER      object
HIRE_DATE         object
JOB_ID            object
SALARY             int64
COMMISSION_PCT    object
MANAGER_ID        object
DEPARTMENT_ID      int64
dtype: object

In [18]:
df.head(2)  # Displays first two rows

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50

In [19]:
df.tail(2)   # Displays last two row

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
48,139,John,Seo,JSEO,650.121.2019,12-FEB-06,ST_CLERK,2700,-,123,50
49,140,Joshua,Patel,JPATEL,650.121.1834,06-APR-06,ST_CLERK,2500,-,123,50

In [20]:
df.sample()  # gives a sample at random

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
29,120,Matthew,Weiss,MWEISS,650.123.1234,18-JUL-04,ST_MAN,8000,-,100,50

In [21]:
df.sample(n=4) # gives a 4 samples at random

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
42,133,Jason,Mallin,JMALLIN,650.127.1934,14-JUN-04,ST_CLERK,3300,-,122,50
18,109,Daniel,Faviet,DFAVIET,515.124.4169,16-AUG-02,FI_ACCOUNT,9000,-,108,100
12,103,Alexander,Hunold,AHUNOLD,590.423.4567,03-JAN-06,IT_PROG,9000,-,102,60
22,113,Luis,Popp,LPOPP,515.124.4567,07-DEC-07,FI_ACCOUNT,6900,-,108,100

In [22]:
df.values  # coverts dataframe into Numpy array

array([[198, 'Donald', 'OConnell', 'DOCONNEL', '650.507.9833',
        '21-JUN-07', 'SH_CLERK', 2600, ' - ', '124', 50],
       [199, 'Douglas', 'Grant', 'DGRANT', '650.507.9844', '13-JAN-08',
        'SH_CLERK', 2600, ' - ', '124', 50],
       [200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444',
        '17-SEP-03', 'AD_ASST', 4400, ' - ', '101', 10],
       [201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555',
        '17-FEB-04', 'MK_MAN', 13000, ' - ', '100', 20],
       [202, 'Pat', 'Fay', 'PFAY', '603.123.6666', '17-AUG-05', 'MK_REP',
        6000, ' - ', '201', 20],
       [203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', '07-JUN-02',
        'HR_REP', 6500, ' - ', '101', 40],
       [204, 'Hermann', 'Baer', 'HBAER', '515.123.8888', '07-JUN-02',
        'PR_REP', 10000, ' - ', '101', 70],
       [205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080',
        '07-JUN-02', 'AC_MGR', 12008, ' - ', '101', 110],
       [206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', '07-JUN-02',
        'AC_ACCOUNT', 8300, ' - ', '205', 110],
       [100, 'Steven', 'King', 'SKING', '515.123.4567', '17-JUN-03',
        'AD_PRES', 24000, ' - ', ' - ', 90],
       [101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', '21-SEP-05',
        'AD_VP', 17000, ' - ', '100', 90],
       [102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', '13-JAN-01',
        'AD_VP', 17000, ' - ', '100', 90],
       [103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567',
        '03-JAN-06', 'IT_PROG', 9000, ' - ', '102', 60],
       [104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', '21-MAY-07',
        'IT_PROG', 6000, ' - ', '103', 60],
       [105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', '25-JUN-05',
        'IT_PROG', 4800, ' - ', '103', 60],
       [106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560',
        '05-FEB-06', 'IT_PROG', 4800, ' - ', '103', 60],
       [107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', '07-FEB-07',
        'IT_PROG', 4200, ' - ', '103', 60],
       [108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569',
        '17-AUG-02', 'FI_MGR', 12008, ' - ', '101', 100],
       [109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', '16-AUG-02',
        'FI_ACCOUNT', 9000, ' - ', '108', 100],
       [110, 'John', 'Chen', 'JCHEN', '515.124.4269', '28-SEP-05',
        'FI_ACCOUNT', 8200, ' - ', '108', 100],
       [111, 'Ismael', 'Sciarra', 'ISCIARRA', '515.124.4369',
        '30-SEP-05', 'FI_ACCOUNT', 7700, ' - ', '108', 100],
       [112, 'Jose Manuel', 'Urman', 'JMURMAN', '515.124.4469',
        '07-MAR-06', 'FI_ACCOUNT', 7800, ' - ', '108', 100],
       [113, 'Luis', 'Popp', 'LPOPP', '515.124.4567', '07-DEC-07',
        'FI_ACCOUNT', 6900, ' - ', '108', 100],
       [114, 'Den', 'Raphaely', 'DRAPHEAL', '515.127.4561', '07-DEC-02',
        'PU_MAN', 11000, ' - ', '100', 30],
       [115, 'Alexander', 'Khoo', 'AKHOO', '515.127.4562', '18-MAY-03',
        'PU_CLERK', 3100, ' - ', '114', 30],
       [116, 'Shelli', 'Baida', 'SBAIDA', '515.127.4563', '24-DEC-05',
        'PU_CLERK', 2900, ' - ', '114', 30],
       [117, 'Sigal', 'Tobias', 'STOBIAS', '515.127.4564', '24-JUL-05',
        'PU_CLERK', 2800, ' - ', '114', 30],
       [118, 'Guy', 'Himuro', 'GHIMURO', '515.127.4565', '15-NOV-06',
        'PU_CLERK', 2600, ' - ', '114', 30],
       [119, 'Karen', 'Colmenares', 'KCOLMENA', '515.127.4566',
        '10-AUG-07', 'PU_CLERK', 2500, ' - ', '114', 30],
       [120, 'Matthew', 'Weiss', 'MWEISS', '650.123.1234', '18-JUL-04',
        'ST_MAN', 8000, ' - ', '100', 50],
       [121, 'Adam', 'Fripp', 'AFRIPP', '650.123.2234', '10-APR-05',
        'ST_MAN', 8200, ' - ', '100', 50],
       [122, 'Payam', 'Kaufling', 'PKAUFLIN', '650.123.3234',
        '01-MAY-03', 'ST_MAN', 7900, ' - ', '100', 50],
       [123, 'Shanta', 'Vollman', 'SVOLLMAN', '650.123.4234',
        '10-OCT-05', 'ST_MAN', 6500, ' - ', '100', 50],
       [124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', '16-NOV-07',
        'ST_MAN', 5800, ' - ', '100', 50],
       [125, 'Julia', 'Nayer', 'JNAYER', '650.124.1214', '16-JUL-05',
        'ST_CLERK', 3200, ' - ', '120', 50],
       [126, 'Irene', 'Mikkilineni', 'IMIKKILI', '650.124.1224',
        '28-SEP-06', 'ST_CLERK', 2700, ' - ', '120', 50],
       [127, 'James', 'Landry', 'JLANDRY', '650.124.1334', '14-JAN-07',
        'ST_CLERK', 2400, ' - ', '120', 50],
       [128, 'Steven', 'Markle', 'SMARKLE', '650.124.1434', '08-MAR-08',
        'ST_CLERK', 2200, ' - ', '120', 50],
       [129, 'Laura', 'Bissot', 'LBISSOT', '650.124.5234', '20-AUG-05',
        'ST_CLERK', 3300, ' - ', '121', 50],
       [130, 'Mozhe', 'Atkinson', 'MATKINSO', '650.124.6234',
        '30-OCT-05', 'ST_CLERK', 2800, ' - ', '121', 50],
       [131, 'James', 'Marlow', 'JAMRLOW', '650.124.7234', '16-FEB-05',
        'ST_CLERK', 2500, ' - ', '121', 50],
       [132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', '10-APR-07',
        'ST_CLERK', 2100, ' - ', '121', 50],
       [133, 'Jason', 'Mallin', 'JMALLIN', '650.127.1934', '14-JUN-04',
        'ST_CLERK', 3300, ' - ', '122', 50],
       [134, 'Michael', 'Rogers', 'MROGERS', '650.127.1834', '26-AUG-06',
        'ST_CLERK', 2900, ' - ', '122', 50],
       [135, 'Ki', 'Gee', 'KGEE', '650.127.1734', '12-DEC-07',
        'ST_CLERK', 2400, ' - ', '122', 50],
       [136, 'Hazel', 'Philtanker', 'HPHILTAN', '650.127.1634',
        '06-FEB-08', 'ST_CLERK', 2200, ' - ', '122', 50],
       [137, 'Renske', 'Ladwig', 'RLADWIG', '650.121.1234', '14-JUL-03',
        'ST_CLERK', 3600, ' - ', '123', 50],
       [138, 'Stephen', 'Stiles', 'SSTILES', '650.121.2034', '26-OCT-05',
        'ST_CLERK', 3200, ' - ', '123', 50],
       [139, 'John', 'Seo', 'JSEO', '650.121.2019', '12-FEB-06',
        'ST_CLERK', 2700, ' - ', '123', 50],
       [140, 'Joshua', 'Patel', 'JPATEL', '650.121.1834', '06-APR-06',
        'ST_CLERK', 2500, ' - ', '123', 50]], dtype=object)

In [23]:
df.axes  # Gives Range as well as information about DataFrame

[RangeIndex(start=0, stop=50, step=1),
 Index(['EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER',
        'HIRE_DATE', 'JOB_ID', 'SALARY', 'COMMISSION_PCT', 'MANAGER_ID',
        'DEPARTMENT_ID'],
       dtype='object')]

In [24]:
df.empty # Tells if  a Dataframe is empty

False

In [25]:
df.T    # Gives Transpose of data  rows get converted to columns and cols to rows

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
EMPLOYEE_ID,198,199,200,201,202,203,204,205,206,100,...,131,132,133,134,135,136,137,138,139,140
FIRST_NAME,Donald,Douglas,Jennifer,Michael,Pat,Susan,Hermann,Shelley,William,Steven,...,James,TJ,Jason,Michael,Ki,Hazel,Renske,Stephen,John,Joshua
LAST_NAME,OConnell,Grant,Whalen,Hartstein,Fay,Mavris,Baer,Higgins,Gietz,King,...,Marlow,Olson,Mallin,Rogers,Gee,Philtanker,Ladwig,Stiles,Seo,Patel
EMAIL,DOCONNEL,DGRANT,JWHALEN,MHARTSTE,PFAY,SMAVRIS,HBAER,SHIGGINS,WGIETZ,SKING,...,JAMRLOW,TJOLSON,JMALLIN,MROGERS,KGEE,HPHILTAN,RLADWIG,SSTILES,JSEO,JPATEL
PHONE_NUMBER,650.507.9833,650.507.9844,515.123.4444,515.123.5555,603.123.6666,515.123.7777,515.123.8888,515.123.8080,515.123.8181,515.123.4567,...,650.124.7234,650.124.8234,650.127.1934,650.127.1834,650.127.1734,650.127.1634,650.121.1234,650.121.2034,650.121.2019,650.121.1834
HIRE_DATE,21-JUN-07,13-JAN-08,17-SEP-03,17-FEB-04,17-AUG-05,07-JUN-02,07-JUN-02,07-JUN-02,07-JUN-02,17-JUN-03,...,16-FEB-05,10-APR-07,14-JUN-04,26-AUG-06,12-DEC-07,06-FEB-08,14-JUL-03,26-OCT-05,12-FEB-06,06-APR-06
JOB_ID,SH_CLERK,SH_CLERK,AD_ASST,MK_MAN,MK_REP,HR_REP,PR_REP,AC_MGR,AC_ACCOUNT,AD_PRES,...,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK
SALARY,2600,2600,4400,13000,6000,6500,10000,12008,8300,24000,...,2500,2100,3300,2900,2400,2200,3600,3200,2700,2500
COMMISSION_PCT,-,-,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-
MANAGER_ID,124,124,101,100,201,101,101,101,205,-,...,121,121,122,122,122,122,123,123,123,123
DEPARTMENT_ID,50,50,10,20,20,40,70,110,110,90,...,50,50,50,50,50,50,50,50,50,50

In [26]:
# creating a DataFrame and using apply function
import numpy as np
df1=pd.DataFrame(np.random.rand(5,3))
df1

          0         1         2
0  0.582940  0.967427  0.207546
1  0.120553  0.028017  0.352376
2  0.478753  0.148133  0.299706
3  0.169859  0.157991  0.160504
4  0.604070  0.862224  0.713665

In [27]:
# apply fucntion take argument a function and applies that on top of a DATAFRAME    
df1.apply(lambda x:max(x))

0    0.604070
1    0.967427
2    0.713665
dtype: float64

In [28]:
df1.apply(lambda x:min(x))

0    0.120553
1    0.028017
2    0.160504
dtype: float64

In [29]:
df1.apply(lambda x: max(x)-min(x))

0    0.483516
1    0.939409
2    0.553160
dtype: float64

In [30]:
df1.apply(np.mean)

0    0.391235
1    0.432758
2    0.346760
dtype: float64

In [31]:
df1[0].apply(lambda x: x+3)
df1

          0         1         2
0  0.582940  0.967427  0.207546
1  0.120553  0.028017  0.352376
2  0.478753  0.148133  0.299706
3  0.169859  0.157991  0.160504
4  0.604070  0.862224  0.713665

In [32]:
df=df1[0].map(lambda x:x*100)
df

0    58.293952
1    12.055350
2    47.875326
3    16.985851
4    60.406988
Name: 0, dtype: float64

In [33]:
import pandas as pd
data=[["Ali",23,9906],["abid",21,9000],["kashif",17,6001],["imran",28,9010]]
dataFrame1=pd.DataFrame(data)
dataFrame1

        0   1     2
0     Ali  23  9906
1    abid  21  9000
2  kashif  17  6001
3   imran  28  9010

In [34]:
#changing row and columns name

dataFrame1.rename(columns={0:"Column0",1:"Column1",2:"Column2"},index={0:"row0",1:"row1",2:"row2",3:"row3",})

     Column0  Column1  Column2
row0     Ali       23     9906
row1    abid       21     9000
row2  kashif       17     6001
row3   imran       28     9010

In [35]:
# priting items in dataframe

for row,col in dataFrame1.iterrows():
    print(row,col)

0 0     Ali
1      23
2    9906
Name: 0, dtype: object
1 0    abid
1      21
2    9000
Name: 1, dtype: object
2 0    kashif
1        17
2      6001
Name: 2, dtype: object
3 0    imran
1       28
2     9010
Name: 3, dtype: object

In [36]:
# in tuple format

for data in dataFrame1.itertuples():
    print(data)

Pandas(Index=0, _1='Ali', _2=23, _3=9906)
Pandas(Index=1, _1='abid', _2=21, _3=9000)
Pandas(Index=2, _1='kashif', _2=17, _3=6001)
Pandas(Index=3, _1='imran', _2=28, _3=9010)

In [37]:
# sort data in columns
dataFrame1

        0   1     2
0     Ali  23  9906
1    abid  21  9000
2  kashif  17  6001
3   imran  28  9010

In [ ]:
dataFrame1.sort_values(by=[1]) # sorts col 1 we can also sort using multiple cols like below example

        0   1     2
2  kashif  17  6001
1    abid  21  9000
0     Ali  23  9906
3   imran  28  9010

In [ ]:
dataFrame1.sort_values(by=[2,1])    # prefence give to parameter passed first

        0   1     2
2  kashif  17  6001
1    abid  21  9000
3   imran  28  9010
0     Ali  23  9906